{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "Classifier", "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 60, 60, 1], "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_1", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "scale": false, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_2", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "scale": false, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_3", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "scale": false, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "flatten_1", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 512, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 36, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Model"}